README.org
#+TITLE: Doom Emacs config
#+AUTHOR: João Luís Teixeira Pinto
#+OPTIONS: ^:{}
* Doom Emacs config
This file is a literate configuration of my Doom Emacs config.

Here are the Emacs LISP code that config Emacs and also the explanation of every
part of the config.

In addition to that, I also document here how I use, or intend to use, such
configuration.
* content about Emacs configs to check out
** David Wilson (system crafters)
*** youtube
**** channel link
https://www.youtube.com/c/SystemCrafters/videos
**** playlists
***** Emacs From Scratch (old)
https://www.youtube.com/playlist?list=PLEoMzSkcN8oPH1au7H6B7bBJ4ZO7BXjSZ
****** 1 Getting Started with a Basic Usable Configuration
****** 2 Adding Helpful UI Improvements
****** 3 Key Bindings and Evil
****** 4 Projectile and Magit
****** 5 Org Mode Basics
****** 6 Organize Your Life with Org Mode
****** 7 Configure Everything with Org Babel
****** 8 Build Your Own IDE with lsp-mode
****** 9 Learn to Love the Terminal Modes
****** 10 Effortless File Management with Dired
****** 11 Keeping Your Emacs Packages Up To Date
****** 12 How to Cut Emacs Start Up Time in Half!
***** Emacs Tips
****** 1 How to Show Reminders for Org Mode Tasks
****** 2 How to Create Your Own Color Theme
****** 3 How to Use File and Directory Local Variables
****** 4 How to Give Presentations with Org Mode
****** 5 How to Create and Manage Multiple Windows - Emacs Tips
****** 6 Organize Your Windows with the Tab Bar in Emacs 27
****** 7 Dynamic Tiling Windows like dwm in Emacs with Edwina
****** 8 Unlock the Power of the Daemon with emacsclient
****** 9 Give Emacs Psychic Completion Powers with prescient.el
****** 10 Teach Emacs to Keep Your Folders Clean
****** 11 How to Encrypt Your Passwords with Emacs
****** 12 Hey Emacs, Don't Move My Windows! - Customizing display-buffer's behavior
****** 13 Streamline Your Emacs Completions with Vertico
****** 14 Doom Emacs or Spacemacs? Use both with Chemacs2!
***** Emacs IDE
****** 1 Emacs From Scratch #8 - Build Your Own IDE with lsp-mode
****** 2 How to Debug Your Code with dap-mode
****** 3 Python Development Configuration
***** Learning Emacs Lisp
****** 1 Introduction to Emacs Lisp - Learning Emacs Lisp #1
****** 2 Types, Conditionals, and Loops - Learning Emacs Lisp #2
****** 3 Defining Functions and Commands - Learning Emacs Lisp #3
****** 4 Defining Variables and Scopes - Learning Emacs Lisp #4
****** 5 Reading and Writing Buffers in Practice - Learning Emacs Lisp #5
****** 6 Managing Files and Directories in Practice - Learning Emacs Lisp #6
****** 7 Creating Custom Minor Modes - Learning Emacs Lisp #7
***** Managing Your Dotfiles
****** 1 The Basics of Dotfiles
****** 2 How to Create a Dotfiles Folder
****** 3 Give Your Dotfiles a Home with GNU Stow
***** Emacs Essentials
****** 1 The Absolute Beginner's Guide to Emacs
****** 2 Efficient Movement with Emacs Key Bindings - Emacs Essentials #2
****** 3 Efficient Text Selection with Emacs Key Bindings - Emacs Essentials #3
***** System Crafters Live!
****** 1 System Crafters Live! - I'm creating a new Lisp • Emacs News • Q&A
****** 2 System Crafters Live! - Lisp Compiler Progress • Live Lisp Hacking • Q&A
****** 3 System Crafters Live! - Taking a look at Magit 3.0 • Streaming with Emacs Lisp
****** 4 System Crafters Live! - So you've installed GNU Guix, now what?
****** 5 System Crafters Live! - Do we really need use-package in Emacs?
****** 6 System Crafters Live! - The Future of System Crafters
****** 7 System Crafters Live! - Can You Apply Zettelkasten in Emacs?
****** 8 System Crafters Live! - Emacs Package Potluck (Trying Your Suggestions!)
****** 9 System Crafters Live! - Can We Fix a Bug in Emacs?
****** 11 System Crafters Live! - The Many Varieties of Emacs
****** 10 System Crafters Live! - The Many Varieties of Emacs (Part 2)
****** 12 System Crafters Live! - A First Look at Guix Home
****** 13 System Crafters Live! - Why Geeks Don't Use Guix
****** 14 System Crafters Live! - Building the World's WORST Emacs Configuration (Part 2)
****** 15 System Crafters Live! - Configuring Emacs With Only the UI?
****** 16 System Crafters Live! - Planning the New Emacs From Scratch
****** 17 System Crafters Live! - Live Crafting: Rational Emacs
****** 18 System Crafters Live! - Trying New Emacs Packages by Minad
***** Mastering Git with Magit
****** 1 An Introduction to the Ultimate Git Interface, Magit!
****** 2 9 Techniques to Boost Your Git Workflow with Magit
****** 3 Fix Your Git Commits Like a Rebase Expert with Magit
***** Advanced Emacs Package Management
****** 1 straight.el: Advanced Emacs Package Management
***** Effective Window Management in Emacs
****** 1 Declutter Your Buffer Lists in Emacs with Perspective.el
***** Build a Second Brain in Emacs
****** 1 Getting Started with Org Roam - Build a Second Brain in Emacs
****** 2 Capturing Notes Efficiently in Emacs with Org Roam
****** 3 Org Roam: The Best Way to Keep a Journal in Emacs
****** 4 5 Org Roam Hacks for Better Productivity in Emacs
***** Emacs Shorts
****** 1 Emacs Has a Built-in Pomodoro Timer?? #Shorts
***** Hack Sessions
****** 1 Improving EXWM #1 // Hack Sessions
****** 2 Improving EXWM #2 // Hack Sessions
****** 3 "Inverse Literate" Emacs Configurations - Hack Sessions
****** 4 "Inverse Literate" Emacs Configurations (Part 2) - Hack Sessions
***** Publishing Websites with Org Mode
****** 1 Build Your Website with Org Mode
****** 2 Automated Org Mode Website Publishing with GitHub or SourceHut
***** Emacs From Scratch (New)
****** 1 The Basics of Emacs Configuration
****** 2 The 6 Emacs Settings Every User Should Consider
*** github
https://github.com/daviwil
https://github.com/daviwil/dotfiles
https://github.com/daviwil/emacs-from-scratch
https://github.com/SystemCrafters
**** System Crafter Configurations
https://github.com/SystemCrafters/crafter-configs
** Jakub Neander(Zaiste Programming)
*** youtube
**** doomcasts playlist
https://www.youtube.com/playlist?list=PLhXZp00uXBk4np17N39WvB80zgxlZfVwj
***** DONE 1 Getting Started
****** discord server
https://discord.com/invite/qvGgnVx

How do I connect to the Discord server?
https://github.com/hlissner/doom-emacs/issues/2720

***** DONE 2 Projects with Projectile, File Explorer with Treemacs & EShell
****** "hotkeys" starting with <SPC>
calling =SPC f f= is the same as =SPC .=, this opens a pane with the
location of the current file and you can navigate from there, also it show the
files on the current directory with additional information
****** working in the context of projects
******* discover project in a directory
There is a coomand: =SPC : projectile-discover-projects-in-directory=, where
you give it a directory and emacs tries to guess based on the directory
structure if it is a project or not. If Emacs can't guess right put an empty
=.projectile= file in the folder.
******* making Emacs aware of project directories at startup
Put the following elisp code on =config.el=:

(up-to-date code)
#+begin_src elisp
(setq projectile-project-search-path '("~/projects/" "~/work/" ("~/github" .
1)))
#+end_src

(code from video)
#+begin_src elisp
(setq
    projectile-project-search-path '("~/code/")
)
#+end_src

You can suppress the auto-discovery of projects on startup by setting
=projectile-auto-discover= to =nil=.

You can manually trigger the project discovery using =M-x
projectile-discover-projects-in-search-path=. Or restart Emacs.

******* projectile docs
https://docs.projectile.mx/projectile/usage.html
******* show all projects that Emacs knows of
Pressing =SPC p p=
******* find a file in projcet
Pressing: =SPC SPC=, will show files only from the current project
******* file explorer (side bar tree view)
Type: =SPC o p=
******* using CLI apps inside emacs
Type: =SPC o e= (~not working currently~)
****** oppening the config files by using hotkeys
Pressing =SPC f p= to "find file in private configuration", or the files that
are inside the =.doom.d= directory
****** file-related commands often used
=SPC f r= for recent files (all files)

=SPC f R= for recent files (in the current project)
***** STOPPED 3 A short intro to Dired
****** showing and hiding details
Type to toggle: =(=
****** navigating
since I enabled =ranger= I can use the following keybindings:

=h= goes back up a directory

=j= and =k= go up and down

=l= goes into the selected directory or file
****** creating folders and files
Press: =SPC .= to create files (works everywhere not only in dired)

Pressing =+= on the dired buffer to create a new folder in the current viewed
folder
****** ...,
stopped at 2:27

I didn't take notes on deleting files and directory (he explained that at this
point already)
***** DONE 4 Buffers, Windows and Basic Navigation
****** switch buffers
press: =SPC b b=, or =SPC ,= to have a list of buffer names (only on curent
project, called a =workspace buffer= by Doom Emacs)

To find other buffers (outside of project, including other workspaces), press:
=SPC b B= or =SPC <=. In this buffer, pressing =SPC= will show only the hidden
buffers
****** closing / killing buffers
pressing =SPC b k=
****** showing 2 buffers at the same time
******* splitting windows
by pressing =C-w v= / =SPC w v= to split window vertically (putting 2 buffers
side by side), or =C-w s= / =SPC w s= to split the window horizontally (putting
2 buffers on top of each other)
******* switching windows
To switch between them, =C-w w= / =SPC w w= will cycle between the windows in
order. You can also use the =h=, =j=, =k=, =l= keys to move between windows.
******* change buffer
in the second window press: =SPC b b= to change the buffer of the window
******* closing windows
to delete a window: =C-w d= / =SPC w d= or =C-w q= / =SPC w q= will delete the
active window
******* resizing windows
By pressing:

=C-w <= / =SPC w <= to grow or shrink the current window to the left

=C-w >= / =SPC w >= to grow or shrink the current window to the right

=C-w += / =SPC w += to grow or shrink the current window to the top

=C-w -= / =SPC w -= to grow or shrink the current window to the bottom

***** DONE 5 Installing Packages with org-super-agenda as an example
****** installing packages (example org-super-agenda)
on the packages file put:

#+begin_src elisp
(package! org-super-agenda)
#+end_src

after that on the command line call:

#+begin_src bash
doom refresh
#+end_src

then agree to install the new package:

: proceed? (y or n) y

****** configuring packages (example org-super-agenda)
now go to the =config.el= to config the new package

#+begin_src elisp
(def-package! org-super-agenda
;; ... config goes here
)
#+end_src

to know what can you configure in a package press:

=SPC h f= for describe function, then type =def-package=

since =def-package= is a wraper around =use-package= it is intresting to know
about it first:

github page: https://github.com/jwiegley/use-package
****** use package summary
use package has "sections" (or named parameters on the form of
=:parameter-name=)

the most important ones are:

=:init= that is everything that happens before the package loads

=:config= is everything that happens after the package loads
****** configuring org super agenda

#+begin_src elisp
(def-package! org-super-agenda
   :init ;; everything that should happen before the package loads
   (setq org-super-agenda-groups
         '(
           (:name "today"
                  :time-grid t
                  :scheduled today)
           (:name "due today"
                  :deadline today)
           (:name "important"
                  :priority "A")
           (:name "overdue"
                  :deadline past)
           (:name "due soon"
                  :deadline future)
           (:name "Big Outcomes"
                  :tag "bo")
           )
    )
   :config ;; enable the mode for example
   (org-super-agenda-mode)
   :after ;; this mode should only load after a certain mode
   (org-agenda)
)
#+end_src
****** config packages that are part of Doom Emacs
Packages that comes with Doom Emacs or packages that are part of the modules
enabled in the =init.el= file, there is another macro:

#+begin_src elisp
(after!

)
#+end_src

it is similar to =def-package!= macro, but only allows to specify certain
configuration options after another package has loaded
***** DONE 6 Quick, horizontal movements with evil-snipe
****** basics of evil-snipe
=evil-snipe= is a package that allows us to quickly jump to a character, it is
an improved functionallity that vim provides, it works in the following way:

press =f= in the =normal mode=, followed by a letter by which you want to jump
to (only in the current line!). After that the available letter locations are
highlighted and you can jump to the next one py pressing =;=, or back by
pressing =,=. By pressing any one of those the occurences of the selected letter
will also be highlighted in on the previous and next lines.

there is also =t= that will jump one character before the matching letter
****** improvements over the functionality present in Vim
as explained in the last section, when moving through the occurencies of
letters, you can go beyond the currend line. That is an improvement made by this
package.

By pressing =s= you can enter 2 letters, resulting in more precise movements

If you want to find a letter before the cursor press =F=. =S= works the same way as =F= but with 2 characters

By pressing =,= in =normal mode= you get your last search forwards, and =;= your
last search backwards;
****** selecting text with evil-snip
In =visual mode= pressing =f=, =F=, =s=, =S=, =,= or =;=
****** disabled functionallity in doom
in Doom Emacs this functionallity is disabled
#+begin_quote
 - you can ~repeat searches with =f=, =F=, =t=, =T= (ala Clever-F)~
#+end_quote

***** DONE 7 Moving around the screen with Avy
****** basics of avy
by pressing =g s= in normal mode or visual mode, the text that will be used in
the search changes color to a dark gray, then you can type the letters that you
want to search in rapid succession

if there are more than one occurency of the word/letter, the places where those
words/letters are found changes to letters that are easy to reach, starting on
the home row, like =a=, =s=, =d=, =f=, etc.
****** using avy on one window vs on all windows
there is a variable that can be customized to change the behavior of avy when it
comes to search only in the current window or in all open windows

=avy-all-windows=, can be either =t= or =nil=, for true or false.
****** changing words with avy
By pressing =g s SPC=, type a letter, or word in rapid succession, then press
=x= (to cut it), then the home-row characters presented. It will remove the
matching word (it won't put you in edit mode)
****** integration with ispell
Using the same process as above, but instead of typing =x=, type =i=

A new window will show up, where correction suggestions follows
single-characters between parenthesis. Pressing any of those letters will change
the highlighted word on the buffer.
****** moving/copying words from one part of the text to another
Press =g i SPC= then the letter/word to search, now press =y= (for
yanking/pasting), following the highlighted selection "mnemonics"

to move a word, do the same as above, instead of =y=, use =t= (for teleporting)
***** WATCHED 8 Multiple cursor in Emacs with evil-multiedit
***** DONE 9 Org Mode, Basic Outlines
not a single thing I didn't know
***** DONE 10 Org Mode - Links, Hyperlinks and more
