README.org
**** NO julia
+ [[file:../modules/lang/julia/README.org][julia]] =+lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;julia             ; a better, faster MATLAB
#+end_src
**** NO kotlin
+ [[file:../modules/lang/kotlin/README.org][kotlin]] =+lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;kotlin            ; a better, slicker Java(Script)
#+end_src
**** yes latex
+ [[file:../modules/lang/latex/README.org][latex]] =+latexmk +cdlatex +fold +lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       latex             ; writing papers in Emacs has never been so fun
#+end_src
**** NO lean
+ lean - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;lean              ; for folks with too much to prove
#+end_src
**** NO ledger
+ [[file:../modules/lang/ledger/README.org][ledger]] - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;ledger            ; be audit you can be
#+end_src
**** NO lua
+ [[file:../modules/lang/lua/README.org][lua]] =+fennel +moonscript= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;lua               ; one-based indices? one-based indices
#+end_src
**** yes markdown
+ [[file:../modules/lang/markdown/README.org][markdown]] =+grip= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       markdown          ; writing docs for people to ignore
#+end_src
**** NO nim
+ [[file:../modules/lang/nim/README.org][nim]] - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;nim               ; python + lisp at the speed of c
#+end_src
**** NO nix
+ [[file:../modules/lang/nix/README.org][nix]] - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;nix               ; I hereby declare "nix geht mehr!"
#+end_src
**** NO ocaml
+ [[file:../modules/lang/ocaml/README.org][ocaml]] =+lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;ocaml             ; an objective camel
#+end_src
**** yes org
+ [[file:../modules/lang/org/README.org][org]] =+brain +dragndrop +gnuplot +hugo +ipython +journal +jupyter +noter +pandoc +pomodoro +present +pretty +roam= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       (org              ; organize your plain life in plain text
        +roam
        +dragndrop
       ;; +ipython
        +journal
        +noter
       ;; +pandoc
       ;; +pomodoro
        +present
        +pretty
        )
#+end_src
**** NO php
+ [[file:../modules/lang/php/README.org][php]] =+hack +lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;php               ; perl's insecure younger brother
#+end_src
**** NO plantuml
+ plantuml - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;plantuml          ; diagrams for confusing people more
#+end_src
**** NO purescript
+ purescript =+lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;purescript        ; javascript, but functional
#+end_src
**** yes python
+ [[file:../modules/lang/python/README.org][python]] =+cython +lsp +pyright +pyenv +conda +poetry= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       (python            ; beautiful is better than ugly
        +lsp
        )
#+end_src
**** NO qt
+ qt - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;qt                ; the 'cutest' gui framework ever
#+end_src
**** NO racket
+ [[file:../modules/lang/racket/README.org][racket]] =+lsp +xp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;racket            ; a DSL for DSLs
#+end_src
**** NO raku
+ [[file:../modules/lang/raku/README.org][raku]] - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;raku              ; the artist formerly known as perl6
#+end_src
**** NO rest (emacs REST client)
+ [[file:../modules/lang/rest/README.org][rest]] - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;rest              ; Emacs as a REST client
#+end_src
**** NO rst
+ rst - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;; rst               ; ReST in peace
#+end_src
**** NO ruby
+ [[file:../modules/lang/ruby/README.org][ruby]] =+lsp +rvm +rbenv +rails +chruby=
#+begin_src emacs-lisp :tangle ./init.el
       ;; (ruby      ; 1.step {|i| p "Ruby is #{i.even? ? 'love' : 'life'}"}
       ;; +rails
       ;; )
#+end_src
**** NO rust
+ [[file:../modules/lang/rust/README.org][rust]] =+lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
      ;; (rust              ; Fe2O3.unwrap().unwrap().unwrap().unwrap()
      ;;  +lsp
      ;;  )
#+end_src
**** NO scala
+ [[file:../modules/lang/scala/README.org][scala]] =+lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;scala             ; java, but good
#+end_src
**** NO scheme
+ [[file:../modules/lang/scheme/README.org][scheme]] =+chez +chibi +chicken +gambit +gauche +guile +kawa +mit +racket= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;; (scheme    ; a fully conniving family of lisps
       ;; +chez
       ;; +chibi
       ;; +chicken
       ;; +gambit
       ;; +gauche
       ;; +guile
       ;; +kawa
       ;; +mit
       ;; +racket
       ;; )
#+end_src
**** NO sh
+ [[file:../modules/lang/sh/README.org][sh]] =+fish +lsp +powershell= - TODO
#+begin_src emacs-lisp :tangle ./init.el
      ;; (sh                ; she sells {ba,z,fi}sh shells on the C xor
      ;;  +lsp
      ;;  +fish
      ;; )
#+end_src
**** NO sml
+ [[file:../modules/lang/sml/README.org][sml]] - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;sml
#+end_src
**** NO solidity
+ [[file:../modules/lang/solidity/README.org][solidity]] - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;solidity          ; do you need a blockchain? No.
#+end_src
**** NO swift
+ swift =+lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;swift             ; who asked for emoji variables?
#+end_src
**** NO terra
+ terra - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;terra             ; Earth and Moon in alignment for performance.
#+end_src
**** yes web (html / css)
+ web =+lsp= - HTML and CSS (SCSS/SASS/LESS/Stylus) support.
#+begin_src emacs-lisp :tangle ./init.el
       (web               ; HTML and CSS (SCSS/SASS/LESS/Stylus) support.
        +lsp
        )
#+end_src
**** NO yaml
+ [[file:../modules/lang/yaml/README.org][yaml]] =+lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
      ;; (yaml              ; JSON, but readable
      ;;  +lsp
      ;;  )
#+end_src
**** NO zig
+ [[file:../modules/lang/zig/README.org][zig]] =+lsp= - Zig support.
#+begin_src emacs-lisp :tangle ./init.el
       ;;zig               ; C, but simpler
#+end_src
*** email
+ [[file:../modules/email/mu4e/README.org][mu4e]] =+org +gmail= - TODO
+ [[file:../modules/email/notmuch/README.org][notmuch]] - TODO
+ wanderlust =+gmail= - TODO

#+begin_src emacs-lisp :tangle ./init.el
       :email
       ;; (mu4e
       ;; +org
       ;; +gmail
       ;; )

       ;;notmuch
       ;; (wanderlust
       ;; +gmail
       ;; )
#+end_src
*** App
Application modules are complex and opinionated modules that transform Emacs
toward a specific purpose. They may have additional dependencies and *should be
loaded last*, before =:config= modules.
**** App start
#+begin_src emacs-lisp :tangle ./init.el
       :app
#+end_src
**** calendar
+ [[file:../modules/app/calendar/README.org][calendar]] - TODO
#+begin_src emacs-lisp :tangle ./init.el
       calendar
#+end_src
**** emms - emacs multimeadia management system?
+ [[file:../modules/app/emms/README.org][emms]] - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;emms
#+end_src
**** everywhere
+ [[file:../modules/app/everywhere/README.org][everywhere]] - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;everywhere        ; *leave* Emacs!? You must be joking
#+end_src
**** irc
+ [[file:../modules/app/irc/README.org][irc]] - how neckbeards socialize
#+begin_src emacs-lisp :tangle ./init.el
       ;;irc               ; how neckbeards socialize
#+end_src
**** rss
+ [[file:../modules/app/rss/README.org][rss]] =+org= - an RSS client in Emacs
#+begin_src emacs-lisp :tangle ./init.el
       ;; (rss         ; emacs as an RSS reader
       ;; +org
       ;; )
#+end_src
**** twitter
+ [[file:../modules/app/twitter/README.org][twitter]] - A twitter client for Emacs
#+begin_src emacs-lisp :tangle ./init.el
       ;;twitter           ; twitter client https://twitter.com/vnought
#+end_src
*** config
Modules that configure Emacs one way or another, or focus on making it easier
for you to customize it yourself. It is best to load these last.

+ [[file:../modules/config/literate/README.org][literate]] - For users with literate configs. This will tangle+compile a
  config.org in your ~doom-private-dir~ when it changes.
+ [[file:../modules/config/default/README.org][default]] =+bindings +smartparens= - The default module sets reasonable defaults
  for Emacs. It also provides a Spacemacs-inspired keybinding scheme and a
  smartparens config. Use it as a reference for your own modules.

#+begin_src emacs-lisp :tangle ./init.el
       :config
       ;;literate
       (default
        +bindings
        +smartparens
        )
#+end_src

*** benchmark startup time
#+begin_src emacs-lisp :tangle no
;;(when doom-debug-p
;;  (require 'benchmark-init)
;;  (add-hook 'doom-first-input-hook #'benchmark-init/deactivate))
#+end_src
*** doom block end
#+begin_src emacs-lisp :tangle ./init.el
)
#+end_src
** config.el
#+begin_src emacs-lisp :tangle ./config.el

#+end_src
*** _
Place your private configuration here! Remember, you do not need to run =doom
sync= after modifying this file!

#+begin_src emacs-lisp :tangle ./config.el
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
#+end_src
*** Info
**** _
Some functionality uses this to identify you, e.g. GPG configuration, email
clients, file templates and snippets.

#+begin_src emacs-lisp :tangle ./config.el
;; Personal information
(setq
      user-full-name "João Luís Teixeira Pinto"
      user-mail-address "jolitp@gmail.com"
)
#+end_src

**** Additional functions/macros
Here are some additional functions/macros that could help you configure Doom:

- =load!= for loading external *.el files relative to this one

- =use-package!= for configuring packages

- =after!= for running code after a package has loaded

- =add-load-path!= for adding directories to the =load-path=, relative to this
  file. Emacs searches the =load-path= when you load packages with =require= or
  =use-package=.

- =map!= for binding new keys

To get information about any of these functions/macros, move the cursor over the
highlighted symbol at press =K= (non-evil users must press =C-c c k=). This will
open documentation for it, including demos of how they are used.

You can also try =gd= (or =C-c c d=) to jump to their definition and see how
they are implemented.
*** Looks
**** Fonts
Doom exposes five (optional) variables for controlling fonts in Doom.

Here are the three important ones:

+ `doom-font'
+ `doom-variable-pitch-font'
+ `doom-big-font' -- used for `doom-big-font-mode'; use this for presentations
  or streaming.
+ 'font-lock-comment-face' -- for comment
+ 'font-lcok-keyword-face' -- for keywords with special significance, like 'for'
  and 'if' in C


They all accept either a font-spec, font string ("Input Mono-12"), or xlfd font
string. You generally only need these two:


#+begin_src emacs-lisp :tangle ./config.el

;; last working config
;; (setq doom-font (font-spec :family "Victor Mono"
;;                            :size 32
;;                            :weight 'medium
;;                 )

;;       doom-variable-pitch-font (font-spec :family "sans"
;;                                           :size 32
;;                                )
;; )
;; last working config

#+end_src

#+begin_src emacs-lisp :tangle ./config.el
(setq doom-font (font-spec :family "Source Code Pro"
                           :size 32
                           :weight 'medium
                )

      doom-variable-pitch-font (font-spec :family "Fira Sans"
                                          :size 32
                               )
)
#+end_src

***** font-spec documentation
font-spec is a built-in function in ‘C source code’.

(font-spec ARGS...)

Return a newly created font-spec with arguments as properties.

ARGS must come in pairs KEY VALUE of font properties. KEY must be a valid font
property name listed below:

... [properties / ARGS] ...

Probably introduced at or before Emacs version 23.1.
****** font-spec properties
******* :family
They are the same as face attributes of the same name. See ‘set-face-attribute’.
******* :weight
They are the same as face attributes of the same name. See ‘set-face-attribute’.
******* :slant
They are the same as face attributes of the same name. See ‘set-face-attribute’.
******* :width
They are the same as face attributes of the same name. See ‘set-face-attribute’.
******* :foundry
VALUE must be a string or a symbol specifying the font foundry, e.g. ‘misc’.
******* :adstyle
VALUE must be a string or a symbol specifying the additional typographic style
information of a font, e.g. ‘sans’.
******* :registry
VALUE must be a string or a symbol specifying the charset registry and encoding
of a font, e.g. ‘iso8859-1’.
******* :size
VALUE must be a non-negative integer or a floating point number specifying the
font size.

It specifies the font size in pixels (if VALUE is an integer), or in points (if
VALUE is a float).
******* :dpi
VALUE must be a non-negative number that specifies the resolution (dot per inch)
for which the font is designed.
******* :spacing
VALUE specifies the spacing of the font: mono, proportional, charcell, or dual.
It can be either a number (0 for proportional, 90 for dual, 100 for mono, 110
for charcell) or a 1-letter symbol: ‘P’, ‘D’, ‘M’, or ‘C’ (lower-case variants
are also accepted).
******* :avgwidth
VALUE must be a non-negative integer specifying the average width of the font in
1/10 pixel units.
******* :name
VALUE must be a string of XLFD-style or fontconfig-style font name.
******* :script
VALUE must be a symbol representing a script that the font must support.

It may be a symbol representing a subgroup of a script listed in the variable
‘script-representative-chars’.
******* :lang
VALUE must be a symbol whose name is a two-letter ISO-639 language name, e.g.
‘ja’.

The value is matched against the "Additional Style" field of the XLFD spec of a
font, if it’s non-empty, on X, and against the codepages supported by the font
on w32.
******* :otf
VALUE must be a list (SCRIPT-TAG LANGSYS-TAG GSUB [ GPOS ]) to specify required
OpenType features.

SCRIPT-TAG: OpenType script tag symbol (e.g. ‘deva’).

LANGSYS-TAG: OpenType language system tag symbol, or nil for the default
language system.

GSUB: List of OpenType GSUB feature tag symbols, or nil if none required.

GPOS: List of OpenType GPOS feature tag symbols, or nil if none required.

GSUB and GPOS may contain nil elements. In such a case, the font must not have
any of the remaining elements.

For instance, if the VALUE is ‘(thai nil nil (mark))’, the font must be an
OpenType font whose GPOS table of ‘thai’ script’s default language system must
contain ‘mark’ feature.
