config.el


;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; Personal information
(setq
      user-full-name "João Luís Teixeira Pinto"
      user-mail-address "jolitp@gmail.com"
)

;; last working config
;; (setq doom-font (font-spec :family "Victor Mono"
;;                            :size 32
;;                            :weight 'medium
;;                 )

;;       doom-variable-pitch-font (font-spec :family "sans"
;;                                           :size 32
;;                                )
;; )
;; last working config

(setq doom-font (font-spec :family "Source Code Pro"
                           :size 32
                           :weight 'medium
                )

      doom-variable-pitch-font (font-spec :family "Fira Sans"
                                          :size 32
                               )
)
