README.org
***** _
Garantees that /italics/ and *bold* shows correctly in org mode, maybe unnecessary.

#+begin_src emacs-lisp :tangle ./config.el
(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t
  )
)
#+end_src

***** _
changes the font type for comments and keyords

#+begin_src emacs-lisp :tangle ./config.el
(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic)
)
#+end_src
***** custom-set-faces! documentation
custom-set-faces! is an autoloaded Lisp macro in ‘autoload/themes.el’.

(custom-set-faces! &rest SPECS)

Apply a list of face SPECS as user customizations.

This is a convenience macro alternative to ‘custom-set-face’ which allows for a
simplified face format, and takes care of load order issues, so you can use
doom-themes’ API without worry.

examples:

#+begin_src emacs-lisp :eval no
(custom-set-faces!
 '(outline-1 :weight normal)
 '(outline-2 :weight normal)
 '(outline-3 :weight normal)
 '(outline-4 :weight normal)
 '(outline-5 :weight normal)
 '(outline-6 :weight normal)
 '(default :background "red" :weight bold)
 '(region :background "red" :weight bold))

(custom-set-faces!
 '((outline-1 outline-2 outline-3 outline-4 outline-5 outline-6)
   :weight normal)
 '((default region)
   :background "red" :weight bold))

(let ((red-bg-faces '(default region)))
  (custom-set-faces!
   `(,(cl-loop for i from 0 to 6 collect (intern (format "outline-%d" i)))
     :weight normal)
   `(,red-bg-faces
     :background "red" :weight bold)))

;; You may utilise `doom-themes's theme API to fetch or tweak colors from their
;; palettes. No need to wait until the theme or package is loaded. e.g.
(custom-set-faces!
 `(outline-1 :foreground ,(doom-color 'red))
 `(outline-2 :background ,(doom-color 'blue)))
#+end_src
**** Theme

There are two ways to load a theme. Both assume the theme is installed and
available. You can either set `doom-theme' or manually load a theme with the
`load-theme' function. This is the default:

#+begin_src emacs-lisp :tangle ./config.el
(setq doom-theme 'doom-one)
#+end_src

**** Line Numbers

This determines the style of line numbers in effect. If set to `nil', line
numbers are disabled. For relative line numbers, set this to `relative'.

#+begin_src emacs-lisp :tangle ./config.el
(setq display-line-numbers-type 'relative)
#+end_src

*** Fixes
**** Remove exit confirmation message
Removes annoying exit confirmation message

#+begin_src emacs-lisp :tangle ./config.el
(setq confirm-kill-emacs nil)
#+end_src
*** Org
**** org files location

If you use `org' and don't want your org files in the default location below,
change `org-directory'. It must be set before org loads!

#+begin_src emacs-lisp :tangle ./config.el
(setq org-directory "~/Dropbox/org/")
#+end_src
**** styles
***** ellipsis
changes ... to an arrow(▼)
#+begin_src emacs-lisp :tangle ./config.el
(after! org
  (setq
    org-ellipsis " ▼ "
  )
)
#+end_src
***** headers
****** _
BUG : defface: Wrong number of arguments: (3 . 3), 2

error: (void-function org-compatible-face)


sets the header color to this order:
1. white
2. blue
3. green
4. red
5. yellow
6. orange
7. ???
8. purple?
9. brown?
10. (0) black/gray

****** example from stack exchange (fail)
#+begin_src emacs-lisp
(progn
  (defface org-level-9 ;; originally copied from org-level-8
    (org-compatible-face
      nil ;; not inheriting from outline-9 because that does not exist
      '((((class color)
          (min-colors 16)
          (background light))
         (:foreground "RosyBrown")
        )
        (((class color)
          (min-colors 16)
          (background dark))
         (:foreground "LightSalmon")
        )
        (((class color)
          (min-colors 8))
         (:foreground "green")
        )
       )
    )
    "Face used for level 9 headlines."
    :group 'org-faces
  )

  (setq org-level-faces
        (append org-level-faces
                (list 'org-level-9)
        )
  )

  (setq org-n-level-faces
        (length org-level-faces)
  )
)
#+end_src
****** documentation about header faces
******* org-level-#
******* org-level-faces
org-level-faces is a variable defined in ‘org-faces.el’.

Its value is
#+begin_src elisp
(org-level-1 org-level-2 org-level-3 org-level-4 org-level-5 org-level-6
org-level-7 org-level-8)
#+end_src

Not documented as a variable.

This variable may be risky if used as a file-local variable.
******* org-n-level-faces
org-n-level-faces is a variable defined in ‘org-faces.el’.

Its value is 9

The number of different faces to be used for headlines.

Org mode defines 8 different headline faces, so this can be at most 8.

If it is less than 8, the level-1 face gets re-used for level N+1 etc.

  You can customize this variable.
******* deffface
defface is a Lisp macro in ‘custom.el’.

(defface FACE SPEC DOC &rest ARGS)

Declare FACE as a customizable face that defaults to SPEC.

FACE does not need to be quoted.

Third argument DOC is the face documentation.

If FACE has been set with ‘custom-theme-set-faces’, set the face
attributes as specified by that function, otherwise set the face
attributes according to SPEC.

The remaining arguments should have the form [KEYWORD VALUE]...
For a list of valid keywords, see the common keywords listed in
‘defcustom’.

SPEC should be a "face spec", i.e., an alist of the form

   ((DISPLAY . ATTS)...)

where DISPLAY is a form specifying conditions to match certain
terminals and ATTS is a property list (ATTR VALUE ATTR VALUE...)
specifying face attributes and values for frames on those
terminals.  On each terminal, the first element with a matching
DISPLAY specification takes effect, and the remaining elements in
SPEC are disregarded.

As a special exception, in the first element of SPEC, DISPLAY can
be the special value ‘default’.  Then the ATTS in that element
act as defaults for all the following elements.

For backward compatibility, elements of SPEC can be written
as (DISPLAY ATTS) instead of (DISPLAY . ATTS).

Each DISPLAY can have the following values:
 - ‘default’ (only in the first element).
 - The symbol t, which matches all terminals.
 - An alist of conditions.  Each alist element must have the form
   (REQ ITEM...).  A matching terminal must satisfy each
   specified condition by matching one of its ITEMs.  Each REQ
   must be one of the following:
   - ‘type’ (the terminal type).
     Each ITEM must be one of the values returned by
     ‘window-system’.  Under X, additional allowed values are
     ‘motif’, ‘lucid’, ‘gtk’ and ‘x-toolkit’.
   - ‘class’ (the terminal’s color support).
     Each ITEM should be one of ‘color’, ‘grayscale’, or ‘mono’.
   - ‘background’ (what color is used for the background text)
     Each ITEM should be one of ‘light’ or ‘dark’.
   - ‘min-colors’ (the minimum number of supported colors)
     Each ITEM should be an integer, which is compared with the
     result of ‘display-color-cells’.
   - ‘supports’ (match terminals supporting certain attributes).
     Each ITEM should be a list of face attributes.  See
     ‘display-supports-face-attributes-p’ for more information on
     exactly how testing is done.

In the ATTS property list, possible attributes are ‘:family’,
‘:width’, ‘:height’, ‘:weight’, ‘:slant’, ‘:underline’,
‘:overline’, ‘:strike-through’, ‘:box’, ‘:foreground’,
‘:background’, ‘:stipple’, ‘:inverse-video’, and ‘:inherit’.

See Info node ‘(elisp) Faces’ in the Emacs Lisp manual for more
information.

  Probably introduced at or before Emacs version 20.3.

#+BEGIN_SRC elisp :eval no
(defface highlight
  '((((class color) (min-colors 88) (background light))
     :background "darkseagreen2")
    (((class color) (min-colors 88) (background dark))
     :background "darkolivegreen")
    (((class color) (min-colors 16) (background light))
     :background "darkseagreen2")
    (((class color) (min-colors 16) (background dark))
     :background "darkolivegreen")
    (((class color) (min-colors 8))
     :background "green" :foreground "black")
    (t :inverse-video t))
  "Basic face for highlighting."
  :group 'basic-faces)
#+END_SRC
****** changes the 1st headers color (fail)
... #+begin_src emacs-lisp :tangle ./config.el
... #+begin_src emacs-lisp
#+begin_src emacs-lisp
;; NEW CHANGE!!!
(after! org
  (defface org-level-1
    (org-compatible-face nil
        '((( (class color)
             (min-colors 16)
             (background light)
           )
           (:foreground "red")
          )
            (((class color)
            (min-colors 16)
            (background dark))
            (:foreground "red")
            )
            (((class color)
            (min-colors 8))
            (:foreground "red")
          )
         )
        "Face used for level 1 headlines."
        :group 'org-faces
    )
  )
)
;; NEW CHANGE!!!
#+end_src

****** changes the 9th headers color (fail)
leave it for later

... #+begin_src emacs-lisp :tangle ./config.el
#+begin_src emacs-lisp
;; CHANGES!!!
(after! org
  ;; (setq org-level-color-stars-only t)
  (progn
    (defface org-level-9 ;; originally copied from org-level-8
        (org-compatible-face
        nil ;; not inheriting from outline-9 because that does not exist
        '((( (class color)
             (min-colors 16)
             (background light)
           )
           (:foreground "green")
          )
            (((class color)
            (min-colors 16)
            (background dark))
            (:foreground "green")
            )
            (((class color)
            (min-colors 8))
            (:foreground "green")
          )
         )
        )
        "Face used for level 9 headlines."
        :group 'org-faces
    )
    ;; appending the 9th level heading style to the org-level-vaces list
    (setq org-level-faces
            (append org-level-faces
                    (list 'org-level-9)
            ))
    ;; setting org-n-level-faces to the length of org-level-faces
    (setq org-n-level-faces
            (length org-level-faces))
  )
)
;; CHANGES!!!
#+end_src
****** complete answer (fail)
... #+begin_src elisp
... #+begin_src emacs-lisp :tangle ./config.el
#+begin_src elisp
(progn
  (progn
    (face-spec-set 'org-level-5 ;; originally copied from org-level-8
      (org-compatible-face
          nil ;; not inheriting from outline-9 because that does not exist
        '((((class color) (min-colors 16) (background light))
           (:foreground "yellow"))
          (((class color) (min-colors 16) (background dark))
           (:foreground "yellow"))
          (((class color) (min-colors 8))
           (:foreground "yellow")))))

    (face-spec-set 'org-level-6 ;; originally copied from org-level-8
      (org-compatible-face
          nil ;; not inheriting from outline-9 because that does not exist
        '((((class color) (min-colors 16) (background light))
           (:foreground "orange"))
          (((class color) (min-colors 16) (background dark))
           (:foreground "orange"))
          (((class color) (min-colors 8))
           (:foreground "orange")))))

    (face-spec-set 'org-level-7 ;; originally copied from org-level-8
      (org-compatible-face
          nil ;; not inheriting from outline-9 because that does not exist
        '((((class color) (min-colors 16) (background light))
           (:foreground "purple"))
          (((class color) (min-colors 16) (background dark))
           (:foreground "purple"))
          (((class color) (min-colors 8))
           (:foreground "purple")))))

    (face-spec-set 'org-level-8 ;; originally copied from org-level-8
      (org-compatible-face
          nil ;; not inheriting from outline-9 because that does not exist
        '((((class color) (min-colors 16) (background light))
           (:foreground "gray"))
          (((class color) (min-colors 16) (background dark))
           (:foreground "gray"))
          (((class color) (min-colors 8))
           (:foreground "gray")))))

    (defface org-level-9 ;; originally copied from org-level-8
      (org-compatible-face
          nil ;; not inheriting from outline-9 because that does not exist
        '((((class color) (min-colors 16) (background light))
           (:foreground "brown"))
          (((class color) (min-colors 16) (background dark))
           (:foreground "brown"))
          (((class color) (min-colors 8))
           (:foreground "brown"))))
      "Face used for level 9 headlines."
      :group 'org-faces)
    (setq org-level-faces (append org-level-faces (list 'org-level-9)))
    (setq org-n-level-faces (length org-level-faces))))
#+end_src
***** bullets
changes the bullets at the start of the headers to roman numerals

NOTE: using more than one character in the list will use /only/ the first
character

#+begin_src emacs-lisp :tangle ./config.el
(after! org
  (setq
;;   org-superstar-headline-bullets-list '("◉" "●" "○" "◆" "●" "○" "◆")
     org-superstar-headline-bullets-list
     '(
;;     "α" "β" "γ" "δ" "ε" "ζ" "η" "θ" "ι" "κ" "λ"     ;; greek
;;     "μ" "ν" "ξ" "ο" "π" "σ" "τ" "υ" "φ" "χ" "ψ" "ω"  ;; lower letters

;;     "♠" "♥" "♦" "♣" "♤" "♡" "♢" "♧"             ;; card suits

;; "⓪" ;; starts at zero?
       "①" "②" "③" "④" "⑤" "⑥" "⑦" "⑧" "⑨" "⑩" ;; empty
       "⑪" "⑫" "⑬" "⑭" "⑮" "⑯" "⑰" "⑱" "⑲" "⑳" ;; circled
       "㉑" "㉒" "㉓" "㉔" "㉕" "㉖" "㉗" "㉘" "㉙" "㉚" ;; numbers
       "㉛" "㉜" "㉝" "㉞" "㉟" "㊱" "㊲" "㊳" "㊴" "㊵"
       "㊶" "㊷" "㊸" "㊹" "㊺" "㊻" "㊼" "㊽" "㊾" "㊿"

;;    "❶" "❷" "❸" "❹" "❺" "❻" "❼" "❽" "❾" "➓" ;; filled circled numbers
     )
  )
)
#+end_src

****** greek alphabet
| Α α   | A a          | alpha   |
| Β β   | B b          | beta    |
| Γ γ   | G g          | gamma   |
| Δ δ   | D d          | delta   |
| Ε ε   | E e          | epsilon |
| Ζ ζ   | Z z          | zeta    |
| Η η   | Ē ē          | eta     |
| Θ θ   | Th th        | theta   |
| Ι ι   | I i          | iota    |
| Κ κ   | C c, K k     | kappa   |
| Λ λ   | L l          | lambda  |
| Μ μ   | M m          | mu      |
| Ν ν   | N n          | nu      |
|       |              |         |
| Ξ ξ   | X x          | xi      |
| Ο ο   | O o          | omicron |
| Π π   | P p          | pi      |
| Ρ ρ   | R r, Rh rh   | rho     |
| Σ σ/ς | S s          | sigma   |
|       |              |         |
| Τ τ   | T t          | tau     |
| Υ υ   | Y y, U u     | upsilon |
| Φ φ   | Ph ph        | phi     |
| Χ χ   | Ch ch, Kh kh | chi     |
| Ψ ψ   | Ps ps        | psi     |
| Ω ω   | Ō ō          | omega   |
***** lists

#+begin_src emacs-lisp :tangle ./config.el
(after! org
  (setq
   org-superstar-item-bullet-alist '((?+ . ?✦) (?- . ?➤))
  )
)
#+end_src
