config.el

(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t
  )
)

(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic)
)

(setq doom-theme 'doom-one)

(setq display-line-numbers-type 'relative)

(setq confirm-kill-emacs nil)

(setq org-directory "~/Dropbox/org/")

(after! org
  (setq
    org-ellipsis " ▼ "
  )
)

(after! org
  (setq
;;   org-superstar-headline-bullets-list '("◉" "●" "○" "◆" "●" "○" "◆")
     org-superstar-headline-bullets-list
     '(
;;     "α" "β" "γ" "δ" "ε" "ζ" "η" "θ" "ι" "κ" "λ"     ;; greek
;;     "μ" "ν" "ξ" "ο" "π" "σ" "τ" "υ" "φ" "χ" "ψ" "ω"  ;; lower letters

;;     "♠" "♥" "♦" "♣" "♤" "♡" "♢" "♧"             ;; card suits

;; "⓪" ;; starts at zero?
       "①" "②" "③" "④" "⑤" "⑥" "⑦" "⑧" "⑨" "⑩" ;; empty
       "⑪" "⑫" "⑬" "⑭" "⑮" "⑯" "⑰" "⑱" "⑲" "⑳" ;; circled
       "㉑" "㉒" "㉓" "㉔" "㉕" "㉖" "㉗" "㉘" "㉙" "㉚" ;; numbers
       "㉛" "㉜" "㉝" "㉞" "㉟" "㊱" "㊲" "㊳" "㊴" "㊵"
       "㊶" "㊷" "㊸" "㊹" "㊺" "㊻" "㊼" "㊽" "㊾" "㊿"

;;    "❶" "❷" "❸" "❹" "❺" "❻" "❼" "❽" "❾" "➓" ;; filled circled numbers
     )
  )
)

(after! org
  (setq
   org-superstar-item-bullet-alist '((?+ . ?✦) (?- . ?➤))
  )
)

(after! org
  (setq
   org-hide-emphasis-markers t
  )
)

(after! org
