README.org
***** emphasis markers
hides /italic/, *bold* and =code= markers for example

#+begin_src emacs-lisp :tangle ./config.el
(after! org
  (setq
   org-hide-emphasis-markers t
  )
)
#+end_src
***** org-appear
****** start after-org! block
#+begin_src emacs-lisp :tangle ./config.el
;; start of org-appear configuration
(after! org
#+end_src
****** NO show only in edit mode
toggles hiding and showing emphasis markers, links, etc. in and out of edit mode

...#+begin_src emacs-lisp :tangle ./config.el
#+begin_src emacs-lisp
(setq org-appear-trigger 'manual)
(add-hook 'evil-insert-state-entry-hook #'org-appear-manual-start nil t)
(add-hook 'evil-insert-state-exit-hook #'org-appear-manual-stop nil t)
#+end_src
****** enable mode
#+begin_src emacs-lisp :tangle ./config.el
  (add-hook 'org-mode-hook 'org-appear-mode)
#+end_src
****** enable for links
enable behavior for links also

[[http://www.google.com][link example (google)]]
#+begin_src emacs-lisp :tangle ./config.el
  (setq org-appear-autolinks t)
#+end_src
****** enable for subscripts and superscripts
******* documentation
enable behavior for subscripts and superscripts

examples:

Add #+OPTIONS: ^:{} to your org-mode file to explicitly enable superscripts and
subscripts.

You would also need to enable pretty-entites using the
=org-toggle-pretty-entities=. Default keychord is: =C-c C-x \=.

#+OPTIONS: ^:{}

superscripts

To create a superscript put ^{ characters at the start of the superscript text
and } at the end of the superscript text, e.g. word ^{superscript} will render as
word^{superscript}.

subscripts

To create a subscript put _{ characters at the start of the subscript text and }
at the end of the subscript text, e.g. word _{subscript} will render as
word_{subscript}.

******* code
#+begin_src emacs-lisp :tangle ./config.el
  (setq org-pretty-entities t)
  (setq org-appear-autosubmarkers t)
#+end_src
****** org entities (latex syntax)
example of entity:

Pro tip: Given a circle \Gamma of diameter d, the length of its
circumference is \pi{}d.

#+begin_src emacs-lisp :tangle ./config.el
  (setq org-appear-autoentities t)
#+end_src
****** org keywords
toggle keywords in =org-hidden-keywords=

#+begin_src emacs-lisp :tangle ./config.el
  (setq org-appear-autokeywords t)
#+end_src
****** delay
1 second of delay

#+begin_src emacs-lisp :tangle ./config.el
  (setq org-appear-delay 1)
#+end_src
****** org-appear-trigger
=org-appear-trigger= can be set to =always=, =on-change=, or =manual=.

With =on-change=, elements will be toggled only when the buffer is modified or on
mouse click. This option disables delayed toggling.

With =manual=, toggling must be enabled by calling =org-appear-manual-start=.
=org-appear-manual-stop= is used to disable toggling with this option.

#+begin_src emacs-lisp :tangle ./config.el
  (setq org-appear-trigger 'always)
#+end_src
****** end after-org! block
#+begin_src emacs-lisp :tangle ./config.el
)
;; end of org-appear configuration
#+end_src
**** roam
adds the location of the org-roam folder

#+begin_src emacs-lisp :tangle ./config.el
(setq org-roam-directory "~/Dropbox/org/roam")
(setq org-roam-dailies-directory "~/Dropbox/org/roam/daily")
#+end_src
*** Keybindings
** packages.el
#+begin_src emacs-lisp :tangle ./packages.el

#+end_src
*** Example usage
**** _
To install a package with Doom you must declare them here and *run =doom sync=
on the command line*, then restart Emacs for the changes to take effect -- or
use =M-x doom/reload=.

#+begin_src emacs-lisp :tangle ./packages.el

;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el
#+end_src

**** packages from MELPA, ELPA or emacsmirror

To install SOME-PACKAGE from MELPA, ELPA or emacsmirror:

#+begin_src emacs-lisp :tangle ./packages.el
;(package! some-package)
#+end_src

**** package from git

To install a package directly from a remote git repo, you must specify a
`:recipe'. You'll find documentation on what `:recipe' accepts here:
https://github.com/raxod502/straight.el#the-recipe-format

#+begin_src emacs-lisp :tangle ./packages.el
;(package! another-package
;  :recipe (:host github :repo "username/repo"))
#+end_src

**** package without PACKAGENAME.el, or in subdirecotry of the repo

If the package you are trying to install does not contain a PACKAGENAME.el
file, or is located in a subdirectory of the repo, you'll need to specify
`:files' in the `:recipe':

#+begin_src emacs-lisp :tangle ./packages.el
;(package! this-package
;  :recipe (:host github :repo "username/repo"
;           :files ("some-file.el" "src/lisp/*.el")))
#+end_src

**** disable a package included with Doom

If you'd like to disable a package included with Doom, you can do so here
with the `:disable' property:

#+begin_src emacs-lisp :tangle ./packages.el
;(package! builtin-package :disable t)
#+end_src

**** overriding the recipe of a built in package

You can override the recipe of a built in package without having to specify
all the properties for `:recipe'. These will inherit the rest of its recipe
from Doom or MELPA/ELPA/Emacsmirror:

#+begin_src emacs-lisp :tangle ./packages.el
;(package! builtin-package :recipe (:nonrecursive t))
;(package! builtin-package-2 :recipe (:repo "myfork/package"))
#+end_src

**** package from a particular branch or tag

Specify a `:branch' to install a package from a particular branch or tag.
This is required for some packages whose default branch isn't 'master' (which
our package manager can't deal with; see raxod502/straight.el#279)

#+begin_src emacs-lisp :tangle ./packages.el
;(package! builtin-package :recipe (:branch "develop"))
#+end_src

**** specify a particular commit
Use `:pin' to specify a particular commit to install.

#+begin_src emacs-lisp :tangle ./packages.el
;(package! builtin-package :pin "1a2b3c4d5e")
#+end_src

**** unpin (Doom) packages
***** single package

Doom's packages are pinned to a specific commit and updated from release to
release. The `unpin!' macro allows you to unpin single packages...

#+begin_src emacs-lisp :tangle ./packages.el
;(unpin! pinned-package)
#+end_src

***** single package

...or multiple packages

#+begin_src emacs-lisp :tangle ./packages.el
;(unpin! pinned-package another-pinned-package)
#+end_src

***** all packages

...Or *all* packages (NOT RECOMMENDED; will likely break things)

#+begin_src emacs-lisp :tangle ./packages.el
;(unpin! t)
#+end_src

*** benchmark startup time

#+begin_src emacs-lisp :tangle ./packages.el
;;(package! benchmark-init)
#+end_src
*** org
**** org-appear

#+begin_src emacs-lisp :tangle ./packages.el
(package! org-appear)
#+end_src

* Notes about configuring Doom Emacs
** _
You can configure Doom by tweaking the files found in your =DOOMDIR=. Doom
expects this directory to be found in one of:

=~/.config/doom= (respects =$XDG_CONFIG_HOME)= or =~/.doom.d= This directory is
referred to as your =DOOMDIR=. Only one of these directories should exist (Doom
will only recognize one).

Change the =DOOMDIR= environment variable to change where Doom looks for this
directory. Symlinks will work as well.

When you ran =doom install=, it deployed a simple Doom configuration to your
=DOOMDIR=, comprised of these three files:
** init.el
Where you’ll find your =doom!= block, which controls what Doom modules are
enabled and in what order they will be loaded.

This file is evaluated early when Emacs is starting up; before any other module
has loaded. You generally shouldn’t add code to this file unless you’re
targeting Doom’s CLI or something that needs to be configured very early in the
startup process.
** config.el
Here is where 99.99% of your private configuration should go. Anything in here
is evaluated after all other modules have loaded, when starting up Emacs.
** packages.el
Package management is done from this file; where you’ll declare what packages to
install and where from.
*** Note:
do not use =M-x customize= or the customize API in general. Doom is designed to
be configured programmatically from your config.el, which can conflict with
Customize’s way of modifying variables.

If you’re concerned about =defcustom= setters, Doom has a =setq!= macro that
will trigger them.
** the doom binary CLI utility
This utility is your new best friend. It won’t spot you a beer, but it’ll
shoulder much of the work associated with managing and maintaining your Doom
Emacs configuration, and then some. Not least of which is installation of and
updating Doom and your installed packages.

It exposes a variety of commands. =bin/doom= help will list them all, but here
is a summary of the most important ones:

- =doom sync=: This synchronizes your config with Doom Emacs. It ensures that
  needed packages are installed, orphaned packages are removed and necessary
  metadata correctly generated. Run this whenever you modify your =doom!= block
  or =packages.el= file. You’ll need =doom sync -u= if you override the recipe
  of package installed by another module.

- =doom upgrade=: Updates Doom Emacs (if available) and all its packages.

- =doom env=: (Re)generates an “envvar file”, which is a snapshot of your shell
  environment that Doom loads at startup. If your app launcher or OS launches
  Emacs in the wrong environment you will need this. **This is required for GUI
  Emacs users on MacOS.**

- =doom doctor=: If Doom misbehaves, the doc will diagnose common issues with
  your installation, system and environment.

- =doom purge=: Over time, the repositories for Doom’s plugins will accumulate.
  Run this command from time to time to delete old, orphaned packages, and with
  the =-g= switch to compact existing package repos.

Use =doom help= to see an overview of the available commands that =doom=
provides, and =doom help COMMAND= to display documentation for a particular
=COMMAND=.

I recommend you add =~/.emacs.d/bin= to your =PATH= so you can call =doom=
directly and from anywhere. Accomplish this by adding this to your .bashrc or
.zshrc file: ~export PATH=”$HOME/.emacs.d/bin:$PATH”~
