config.el

  (add-hook 'org-mode-hook 'org-appear-mode)

  (setq org-appear-autolinks t)

  (setq org-pretty-entities t)
  (setq org-appear-autosubmarkers t)

  (setq org-appear-autoentities t)

  (setq org-appear-autokeywords t)

  (setq org-appear-delay 1)

  (setq org-appear-trigger 'always)

)

(setq org-roam-directory "~/Dropbox/org/roam")
(setq org-roam-dailies-directory "~/Dropbox/org/roam/daily")
